{"text": "An old doll has been discovered in an attic. It's known that if the doll has both a porcelain head and a cloth body", "label": "then it is considered an antique doll."}
{"text": "If one does not believe in the existence of God or gods", "label": "then one takes an agnostic stance on the existence of the divine."}
{"text": "If the factory has sufficient raw materials or the machines are functioning properly", "label": "then the factory is able to meet its production quota."}
{"text": "If either Platonism holds that abstract objects exist independently of the physical world, or Aristotelianism maintains that universals exist only insofar as they are instantiated in particular things", "label": "then the two schools have fundamentally different metaphysical views about the nature of abstract objects."}
{"text": "If metaphysics does not provide a foundation for ethics", "label": "then ethics must rely on other philosophical branches for its basis."}
{"text": "If a holy text contains factual and historical inaccuracies or a religion's moral teachings lead to harm", "label": "then that religion can be validly criticized."}
{"text": "In designing a new aircraft for a specific mission, meeting the required range specifications or payload capacity", "label": "implies that the aircraft design is viable for the intended mission."}
{"text": "If Jesus was not a real historical figure", "label": "then Christianity would have no legitimate basis as a religion founded on his life and teachings."}
{"text": "When the unemployment rate is low and consumer confidence is high", "label": "this implies that the economy is in a strong expansion phase."}
{"text": "If John has a business trip next week or his family is visiting from out of town", "label": "then he needs to make a detailed schedule."}
{"text": "If the speaker's argument is logically valid or has true premises", "label": "then the speaker's conclusion must be true."}
{"text": "If John does not have his swimming goggles", "label": "then he cannot practice his underwater swimming techniques."}
{"text": "If the billionaire did not make risky investments", "label": "then their net worth decreased."}
{"text": "If the Satanic coven's dark ritual involves either a blood sacrifice or chanting forbidden incantations", "label": "then the coven will perform a sinister ceremony on the night of the new moon."}
{"text": "In epistemology, in order for an individual to claim they have knowledge about reality, they must have justified true beliefs about the external world.", "label": "Additionally, the way they acquire those beliefs, such as through sense perception, must be a reliable source of knowledge."}
{"text": "If a billionaire did not inherit their wealth, that", "label": "implies they built their fortune through their own efforts and initiatives."}
{"text": "If the town does not have a growing population", "label": "then new housing developments are not being built."}
{"text": "If the company has excess inventory or needs to raise capital quickly", "label": "then the company decides to have a clearance sale."}
{"text": "If the dataset does not satisfy the multivariate normality assumption", "label": "then robust estimation methods need to be used for the analysis."}
{"text": "If the spacecraft has enough fuel to reach Mars and the navigation systems are functioning properly", "label": "then the mission to Mars can proceed as planned."}
{"text": "If the car's engine is running and there is fuel in the gas tank", "label": "then the car is able to drive."}
{"text": "If John enrolls in a public speaking class or joins a debate club", "label": "then it implies he is working on improving his communication skills."}
{"text": "If the radio antenna is not properly tuned", "label": "then the radio signal reception will be poor."}
{"text": "In systems theory, if a system does not have well-defined boundaries", "label": "then it becomes difficult to understand the system's interactions with its environment."}
{"text": "If the solar panels are not generating enough electricity", "label": "then the battery storage will be depleted as it is used to power the home."}
{"text": "In logic, modus ponens is considered a valid logical argument form. If an argument has the modus ponens form and its premises are true", "label": "then it necessarily follows that the conclusion of the argument is also true."}
{"text": "If John does not clearly see the words on the eye chart during his vision test, that", "label": "implies he likely needs corrective lenses such as glasses or contacts to improve his visual perception and acuity."}
{"text": "If the settlers have found a suitable area to establish their new community and they have sufficient supplies and resources to get started", "label": "then they are ready to begin building their settlement."}
{"text": "If John has a hunting rifle or if he has hunting traps and snares", "label": "then that implies John has the necessary equipment to go hunting."}
{"text": "If the annual film festival is not happening this year", "label": "then the local arts community would be disappointed."}
{"text": "In a certain region, if prolonged drought conditions are not present", "label": "then the risk of wildfires increases."}
{"text": "If the village has a reliable well for fresh water or the village is located near a clean river", "label": "then the villagers have a steady supply of potable water."}
{"text": "If a survey has a sufficiently large sample size or uses random sampling", "label": "then the survey results can be generalized to the broader population."}
{"text": "For a stochastic process to be classified as a Poisson process, it must have either a constant rate parameter λ or exponentially distributed time intervals between events. If either of these properties hold", "label": "then the process is a continuous-time Markov process."}
{"text": "If John's bicycle tire is flat or his bicycle chain is broken", "label": "then John cannot ride his bicycle."}
{"text": "If the video editing software has the latest codec pack installed or the video file format is supported by the editing software", "label": "then the video can be successfully imported into the editing program."}
{"text": "If John and Mary are not getting along well", "label": "then it implies that their relationship is under stress."}
{"text": "If the village storyteller knows the legend of the golden fleece or the tale of the clever fox", "label": "then the storyteller can entertain the children tonight."}
{"text": "If renewable energy sources are not being widely adopted", "label": "then greenhouse gas emissions are not being reduced."}
{"text": "For an IQ test to be considered a good measure of intelligence, it must have both high reliability and high validity.", "label": "Reliability refers to the consistency of test scores, while validity refers to how well the test actually measures intelligence."}
{"text": "If the track conditions are not muddy", "label": "then the favorite horse does not have an advantage."}
{"text": "If a patient is experiencing numbness in their extremities or having difficulty with fine motor skills", "label": "then they may have a neurological disorder affecting their peripheral nerves."}
{"text": "If the Olympic torch is not lit", "label": "then the opening ceremony cannot begin."}
{"text": "If a flower has not been pollinated by bees", "label": "then it will not produce fruit."}
{"text": "If a philosopher is presenting either a valid deductive argument or a valid inductive argument", "label": "then the philosopher's overall argument is logically sound."}
{"text": "If the quarterly sales target was achieved or the marketing campaign was successful", "label": "then the company had a profitable quarter."}
{"text": "If either Lemma 1 is true or Lemma 2 is true", "label": "then Theorem A can be proved."}
{"text": "If the tribe does not have a matrilineal kinship system", "label": "then inheritance and property are not passed down through the female line."}
{"text": "If Dr. Smith has both formulated a new hypothesis and collected supporting experimental data", "label": "then he is ready to publish his research findings."}
{"text": "If the king is both just and fair in his rule, and beloved by his subjects", "label": "then it implies that the kingdom will be prosperous and stable."}
{"text": "If John lives in either New York City or Los Angeles", "label": "then it implies he lives in a major U.S. city."}
{"text": "If John has an important project deadline approaching at work and his project requires him to put in extra hours this week", "label": "then it implies that John will be working overtime."}
{"text": "If the marketing team has gathered sufficient customer data or the product team has developed new feature ideas based on user feedback", "label": "then the organization has valuable insights for guiding their product strategy."}
{"text": "If the trapeze artist at the circus is not performing a dangerous stunt", "label": "then additional safety measures are put in place as a precaution."}
{"text": "If John did not enjoy the movie", "label": "then he does not recommend the movie to his friends."}
{"text": "If the company has sufficient cash flow or if it secures additional financing", "label": "then it can fund its expansion plans."}
{"text": "If a function f(x) is continuous on the closed interval [a,b] or differentiable on the open interval (a,b)", "label": "then it is both continuous and differentiable on [a,b]."}
{"text": "When a new comet is discovered in the night sky, and that comet's orbit brings it close to Earth", "label": "then the comet will be visible to the naked eye."}
{"text": "If John is studying the phonology of a new language or he is analyzing the syntax of the language", "label": "then he is conducting linguistic research on the language."}
{"text": "If a ceasefire between the warring countries has been declared or peace talks between the warring factions have begun", "label": "then hostilities between the warring sides will cease."}
{"text": "If a plant is receiving sufficient water and getting adequate sunlight", "label": "then it is able to photosynthesize and produce its own food through that process."}
{"text": "If John is reading a textbook and taking notes on the material", "label": "then John is actively focusing his attention on studying."}
{"text": "If an author uses vivid imagery and employs a non-linear narrative structure in their writing", "label": "then the resulting novel can be considered an example of experimental literature."}
{"text": "During a spiritualist séance, the medium may sense the presence of a spirit. Alternatively, the séance participants might hear mysterious knocking sounds. Either of these occurrences", "label": "would suggest that a spirit is trying to communicate with the living."}
{"text": "If John is proficient in Python programming and he understands object-oriented programming principles", "label": "then he can develop complex software applications."}
{"text": "If John did not commit the robbery", "label": "then there would be no evidence linking him to the crime scene."}
{"text": "If the patient has severe abdominal pain or their appendix is inflamed", "label": "then the patient likely has appendicitis."}
{"text": "If John is not an experienced programmer", "label": "then he struggles to debug his code."}
{"text": "If the Nile river has high water levels this season or there have been heavy rains causing flooding in the upper Nile basin", "label": "then the Nile delta will experience increased sediment deposition."}
{"text": "If John is analyzing a complex problem and he breaks the problem down into smaller parts", "label": "then he gains clarity on how to approach solving the problem."}
{"text": "If an agnostic believes both that the existence of God or the divine is unknown, and that the existence of God or the divine is unknowable", "label": "then they hold the view that God's existence cannot be proven or disproven."}
{"text": "If a coal power plant is operating at full capacity or there are a high number of diesel trucks on the roads", "label": "then air pollution levels in the city will be elevated."}
{"text": "If a patient has both a high fever and severe muscle aches", "label": "then the patient likely has influenza."}
{"text": "If Zeus is the king of the Greek gods or wields a powerful thunderbolt", "label": "then it implies that Zeus is a mighty and revered deity."}
{"text": "If John did not perform his usual weightlifting routine", "label": "then he did not experience muscle hypertrophy gains."}
{"text": "If sedimentary rocks are not being deposited in a basin, that", "label": "implies the basin is not subsiding."}
{"text": "If the philosopher did not receive a large research grant", "label": "then they will need to spend more time teaching classes this semester to support themselves financially."}
{"text": "If John exercises regularly or eats a balanced diet", "label": "then he is in good physical health."}
{"text": "If the time series data shows an upward trend or there is a positive correlation between the time series variables", "label": "then the time series analysis indicates growth."}
{"text": "If the data does not follow a normal distribution", "label": "then non-parametric statistical methods should be used for analysis."}
{"text": "If John believes extraordinary claims require extraordinary evidence and he demands rigorous proof before accepting paranormal phenomena", "label": "then it implies John has a skeptical mindset."}
{"text": "If Li practices Falun Gong meditation exercises or studies Falun Gong's moral philosophy teachings", "label": "then it implies Li is a dedicated Falun Gong practitioner."}
{"text": "If the defense does not have exculpatory evidence that would prove the defendant's innocence", "label": "then the defendant is likely guilty of the crime charged."}
{"text": "If the indigenous tribe either performs a rain dance ritual or makes offerings to their rain god", "label": "then it means the tribe is attempting to invoke rain through spiritual means."}
{"text": "If John has both a map of the hiking trail and a working compass", "label": "then he can navigate the hiking trail."}
{"text": "If John did not solve the arithmetic problem correctly", "label": "then it implies he made a mistake in his calculations."}
{"text": "If the city has allocated budget for road repairs and the necessary construction equipment is available", "label": "then the road repair project can begin on schedule."}
{"text": "If John set a goal to get in shape this year or made a New Year's resolution to lose weight", "label": "then it implies that John is motivated to improve his health and fitness."}
{"text": "If the initial blueprint does not meet all of the client's requirements", "label": "then the design team needs to make revisions to the blueprint."}
{"text": "If a dataset has a large sample size and is representative of the population", "label": "then the results of analyzing that dataset can be generalized to the broader population."}
{"text": "If the survey sample size is not large enough to be representative of the population or if a biased sampling method was used", "label": "then the survey results may not be reliable for making inferences about the overall population."}
{"text": "If Dr. Smith's research grant is not approved", "label": "then he cannot conduct his planned experiments."}
{"text": "If the mean of the data set is calculated and the median of the data set is calculated", "label": "then the key measures of central tendency are determined."}
{"text": "If the new policy proposal is not approved by the legislature", "label": "then the government agency cannot implement the new public program that the policy would enable."}
{"text": "If it is true that Homer wrote both the Iliad and the Odyssey", "label": "then it implies Homer was an ancient Greek epic poet."}
{"text": "If John did not understand the concept of derivatives", "label": "then it implies he failed his Calculus exam."}
{"text": "If a patient's vision is blurry when looking at things far away and they also have trouble reading small print up close", "label": "then the patient likely needs corrective lenses such as glasses or contacts."}
{"text": "When searching for an optimal path, if the problem setup involves estimating the remaining distance to the goal using a heuristic rule", "label": "then the search algorithm is able to efficiently find a solution."}
{"text": "If John is naturally introverted and he avoids social situations when possible", "label": "then it implies he has a reserved personality."}
{"text": "If John works at either a tech startup or a large corporation", "label": "then his company provides good health insurance benefits."}
{"text": "In John's religion, either lying or cheating (or both) are considered sins.", "label": "This implies that John believes he should avoid committing sins."}
{"text": "If the Midwest region experienced higher than average rainfall this year, and the soil in the Midwest plains retained ample moisture", "label": "then crop yields in the Midwest are expected to be bountiful this harvest season."}
{"text": "If Joseph Smith did not receive divine revelations", "label": "then the Book of Mormon would not be considered scripture by Mormons."}
{"text": "If John has all the edge pieces of the jigsaw puzzle and he has sorted the remaining pieces by color", "label": "then he is ready to start assembling the puzzle."}
{"text": "In a statistical study, if the sample size is not sufficiently large", "label": "then the margin of error will exceed the acceptable threshold."}
{"text": "If David's argument is not logically valid", "label": "then his conclusion does not follow from his premises."}
{"text": "If the proposed law does not have sufficient public support", "label": "then the activist group will organize a protest rally."}
{"text": "According to the religious beliefs, if the people have been virtuous and devout in their worship, and the necessary ritual sacrifices have been made to the gods", "label": "then the gods will bless the people with a bountiful harvest."}
{"text": "If the city has secured funding for the new bridge project or the environmental impact study for the bridge has been approved", "label": "then construction on the new bridge can begin."}
{"text": "If John has been practicing Tai chi for a year and he attends Tai chi classes regularly", "label": "then he has improved his balance and flexibility."}
{"text": "If the code does not pass all the test cases or there are runtime errors", "label": "then the program is not ready to deploy."}
{"text": "The Tibetan Plateau has an average elevation exceeding 4,500 meters and is surrounded by towering mountain ranges.", "label": "Together, these features imply that the Tibetan Plateau is extremely high and isolated."}
{"text": "If the company maintains lists of both full-time and part-time employees", "label": "then it implies the company has a comprehensive employee directory."}
{"text": "If the star striker is not injured", "label": "then he will not start the match."}
{"text": "If the enemy forces have not launched an attack", "label": "then the military base remains at a normal alert level."}
{"text": "If the pilot has completed all the pre-flight checks or the aircraft has been fueled and is ready for departure", "label": "then the flight is cleared for takeoff."}
{"text": "If the Riemann hypothesis has not been proven", "label": "then certain properties of the Riemann zeta function remain unproven."}
{"text": "According to Islamic law, the new lunar month begins based on the sighting of the new moon.", "label": "Fasting is obligatory for Muslims during the daylight hours of the month of Ramadan and ends with the sighting of the next new moon."}
{"text": "If John has saved up enough money for a trip and he can take time off work for a vacation", "label": "then he is able to go on an international trip."}
{"text": "John has been practicing the slow, gentle movements of Tai chi and focusing on proper breathing techniques during his practice. If both of these are true", "label": "then it implies that John is experiencing the meditative and stress-reducing benefits of Tai chi."}
{"text": "If an ancient pottery shard is discovered at the archaeological dig site and the shard has distinctive markings on it", "label": "then it likely belongs to the Sumerian civilization."}
{"text": "If John received a bonus at work or got money for his birthday", "label": "then he has extra cash to spend."}
{"text": "If John is in the mood to watch an action movie or there is a new superhero blockbuster showing in theaters", "label": "then John decides to go to the cinema tonight."}
{"text": "In the pantheon of Egyptian gods, Ra is the almighty sun god. It is believed that if Ra is not angry", "label": "then the crops will flourish."}
{"text": "If Mount Everest is the tallest mountain in the world and K2 is the second tallest mountain in the world", "label": "then both Mount Everest and K2 are part of the Himalayan mountain range."}
{"text": "John wants to go on a hiking trip this weekend, and the weather forecast predicts clear skies and mild temperatures. If both of these conditions are true", "label": "then the conditions are perfect for John's hiking trip."}
{"text": "Deforestation is occurring at a rapid rate in the Amazon and cattle ranching is expanding into new areas of the rainforest. If both of these activities are happening", "label": "then the Amazon rainforest ecosystem is being severely degraded."}
{"text": "If John did not study for his calculus exam", "label": "then he will be worried that he will fail the exam."}
{"text": "If a town does not have a large population", "label": "then it is not classified as a city."}
{"text": "In Theosophy, it is believed that if a seeker has not attained direct knowledge of the divine through mystical experiences and esoteric practices", "label": "then the seeker's consciousness remains limited by the illusions of the material world and they are unable to perceive the true spiritual nature of existence."}
{"text": "If John works for Acme Inc. and is a manager at the company", "label": "then it implies he has been with Acme Inc. for over 5 years."}
{"text": "If a microchip does not have features smaller than 1 micron (1 millionth of a meter)", "label": "then it cannot be used in the latest miniaturized electronic devices that require such tiny component sizes."}
{"text": "If the town is holding its annual summer festival this weekend or the town is celebrating a special holiday this weekend", "label": "then there will be large crowds and many events in town this weekend."}
{"text": "If a dress shirt is both wrinkle-free and has no stains", "label": "then it is considered presentable to wear."}
{"text": "If birth rates are not declining", "label": "then the population continues to grow rapidly."}
{"text": "In a designed experiment, if the treatment factor levels were properly randomized and sufficient replications were performed", "label": "then the experiment would have high internal validity."}
{"text": "If a patient is experiencing numbness in their hands or having difficulty with fine motor control", "label": "then they may have carpal tunnel syndrome, a condition caused by compression of the median nerve as it passes into the hand."}
{"text": "If an area of land has experienced significant uplift or been shaped by powerful erosional forces", "label": "then the terrain will feature tall, steep mountains."}
{"text": "If John has new running shoes and the weather is nice outside", "label": "then he decides to go for a run."}
{"text": "If a national park has a diverse ecosystem and the area is designated as a wildlife refuge", "label": "then the region is classified as a protected natural area."}
{"text": "If the product design meets all functional requirements or satisfies all manufacturing constraints", "label": "then the product design is approved to proceed to prototyping."}
{"text": "If a politician supports lowering taxes and advocates for reducing government spending", "label": "then the politician takes a fiscally conservative stance."}
{"text": "If the tumor is not benign", "label": "then the patient requires treatment."}
{"text": "If John studied the material thoroughly or the test questions covered the key concepts well", "label": "then John was able to recall the relevant information during the test."}
{"text": "Cheetahs being the fastest land animals and being able to reach speeds over 60 mph", "label": "implies that they are superbly adapted for speed."}
{"text": "If the United States has advanced research in artificial intelligence and China is investing heavily in quantum computing", "label": "then the two countries are leaders in emerging technologies."}
{"text": "In structural engineering, the soundness of a building's structural integrity depends on several factors. If the load-bearing walls are properly reinforced and the foundation is stable and properly anchored", "label": "then the overall structural integrity of the building will be sound."}
{"text": "If John is feeling depressed and has lost interest in activities he used to enjoy", "label": "then he may be experiencing clinical depression."}
{"text": "If either the Sahara desert receives heavy rainfall this year or the Amazon rainforest experiences severe drought conditions", "label": "then it implies that some of Earth's major ecosystems are undergoing significant changes in weather patterns."}
{"text": "If a strong earthquake occurred in the region or the tectonic plates along a fault line shifted significantly", "label": "then seismic waves would be detected by monitoring stations."}
{"text": "If John attends all his classes regularly and takes detailed notes during lectures", "label": "then he is a diligent student."}
{"text": "If a claim is not justified by reliable evidence", "label": "then it does not constitute knowledge according to epistemology."}
{"text": "If the forest does not have dense tree cover", "label": "then more sunlight is able to reach the forest floor."}
{"text": "If the project deadline has not been extended", "label": "then the team will not be able to complete all deliverables on time."}
{"text": "If John has all the ingredients to make either pasta primavera or a Caesar salad", "label": "then he can prepare a satisfying dinner tonight."}
{"text": "If the neurotransmitter levels in a patient's brain are not within the normal range", "label": "then the patient will exhibit neurological symptoms."}
{"text": "John is feeling excited about his upcoming vacation. At the same time, John is also nervous about flying on an airplane. If John is feeling both excitement and nervousness", "label": "then he is experiencing mixed emotions."}
{"text": "If Alex identifies as non-binary or uses they/them pronouns", "label": "then Alex's gender identity is outside the male/female binary."}
{"text": "If John works either the day shift or the night shift at the factory", "label": "then it can be concluded that John works at the factory."}
{"text": "If the estuary does not have a high inflow of fresh water from rivers", "label": "then the salinity level in the estuary is not diluted."}
{"text": "If the protest did not have a large turnout", "label": "then the activists' message failed to reach a wide audience."}
{"text": "If either the shipping container has been loaded onto the cargo ship or the shipping documents have been approved by customs", "label": "then the shipment is ready to depart port."}
{"text": "If the network switch is configured properly or all the network cables are securely connected", "label": "then the company's local area network (LAN) will function normally."}
{"text": "If the town has a growing population or new housing developments are being built", "label": "then the town is expanding in size."}
{"text": "If John does not take time to reflect on his goals and priorities", "label": "then he tends to make impulsive decisions without careful consideration."}
{"text": "If atmospheric carbon dioxide levels are increasing or methane emissions from permafrost are increasing", "label": "then this implies that greenhouse gas concentrations in the atmosphere are rising."}
{"text": "If an artist's new painting includes nude figures or makes a strong political statement", "label": "then the painting may be considered controversial and face potential censorship."}
{"text": "If the spacecraft has sufficient fuel reserves or the life support systems are functioning properly", "label": "then the crew is ready to launch into space."}
{"text": "If a patient has both elevated TSH levels and low T4 levels", "label": "then they are diagnosed with primary hypothyroidism."}
{"text": "If a country has both a positive population growth rate and high net migration into the country", "label": "then the country's total population must be increasing."}
{"text": "If a researcher formulates a hypothesis and designs an experiment to test the hypothesis", "label": "then the researcher is following the scientific method."}
{"text": "If the source code for a piece of software is not openly available", "label": "then that software does not meet the criteria to be considered free software."}
{"text": "If the Crimean Peninsula is under Russian control and Crimea is an autonomous republic within Ukraine", "label": "then the political status of Crimea is disputed."}
{"text": "If a concept is well-defined or has clear necessary and sufficient conditions", "label": "then the concept can be rigorously analyzed."}
{"text": "A new cancer treatment was evaluated for its impact on 5-year survival rates. The treatment showed promising initial results by slowing tumor growth in the first 2 years and reducing toxic side effects compared to standard chemotherapy.", "label": "If the treatment both slowed early tumor growth and reduced side effects, it was hypothesized to improve overall 5-year survival."}
{"text": "If John believes it is morally right to always tell the truth or he believes white lies are sometimes acceptable to avoid hurting people's feelings", "label": "then John faces an ethical dilemma about whether to be fully honest in a sensitive situation."}
{"text": "If there is a drought or the river's water level is low", "label": "then irrigation for crops will be limited."}
{"text": "If the automotive factory has sufficient raw materials or enough skilled workers available", "label": "then it is able to maintain full production."}
{"text": "If the star striker on a soccer team is healthy and the opposing team they are facing has a weak defense", "label": "then the striker is likely to score a goal in the match."}
{"text": "If the lake is not experiencing an algal bloom", "label": "then the water clarity in the lake is high."}
{"text": "If John has a vivid imagination and he enjoys daydreaming", "label": "then it implies that John frequently gets lost in his own imaginary worlds."}
{"text": "If John does not have a balanced diet", "label": "then he is at risk for nutritional deficiencies."}
{"text": "If the prime minister did not resign from office", "label": "then there is no leadership vacancy in the government."}
{"text": "If John does not go for a bike ride in the morning", "label": "then he feels sluggish and has low energy during the day."}
{"text": "If the connector pins are not properly aligned", "label": "then an electrical connection will not be made."}
{"text": "If the fjord was not carved by glacial activity over many ice age cycles", "label": "then it would not be a long, deep, narrow inlet of the sea between high cliffs, which are characteristic features of fjord landscapes."}
{"text": "If the king is old and in poor health, and he does not have a clear heir to the throne", "label": "then there will be uncertainty about the line of succession."}
{"text": "If a swamp has high rainfall this season and the water level in the swamp is rising", "label": "then the swamp is becoming flooded."}
{"text": "If a building is located in a high seismic hazard zone and it was constructed before modern seismic codes were implemented", "label": "then the building is at high risk of damage during an earthquake."}
{"text": "If the factory has sufficient raw materials or the factory machines are operating properly", "label": "then the factory is able to meet its production quota."}
{"text": "In Parametric Statistics, certain assumptions need to be met in order to use parametric methods for data analysis. If the data is assumed to be normally distributed and the sample size is sufficiently large (typically greater than 30)", "label": "then parametric statistical methods can be used to analyze the data."}
{"text": "If the researcher has either formulated a testable hypothesis or designed a controlled experiment", "label": "then the researcher is ready to collect empirical data."}
{"text": "If John is not taking modafinil, a popular nootropic substance", "label": "then his cognitive function and mental performance are not enhanced."}
{"text": "If the global population growth rate remains high and resource consumption per capita continues increasing", "label": "then human demands are exceeding the Earth's carrying capacity."}
{"text": "If John uses a daily moisturizer with SPF or applies a vitamin C serum each morning", "label": "then his skin will be well hydrated and protected from sun damage."}
{"text": "If the dataset does not contain any missing values", "label": "then data cleaning and preprocessing is not required."}
{"text": "If Sarah believes in the power of crystals and meditates daily", "label": "then she feels a strong spiritual connection."}
{"text": "If the rugby pitch is wet from rain and the rugby match is postponed to a later date", "label": "then the rugby match between England and New Zealand will not be played as scheduled."}
{"text": "If a solar flare does not erupt from the Sun", "label": "then the Earth's magnetic field is not disrupted."}
{"text": "If John has been doing regular push-ups and dips", "label": "then he is training his chest and tricep muscles."}
{"text": "If the lowlands have rich, fertile soil or abundant rainfall", "label": "then the lowlands are ideal for agriculture."}
{"text": "If the library database contains the full text of an article or at least the article citation and abstract", "label": "then researchers can access the key information about the article."}
{"text": "If an individual embraces the ideas of self-reliance and living simply in nature, or an individual believes in the inherent goodness of both people and nature", "label": "then the individual is a follower of Transcendentalism."}
{"text": "If God does not exist", "label": "then the universe has no ultimate purpose or meaning."}
{"text": "If an experiment does not utilize a full factorial design", "label": "then some combinations of the factors will not be tested in the experiment."}
{"text": "If John is an extrovert or he is confident in social situations", "label": "then it implies he enjoys being around people."}
{"text": "If Jane is studying either single digit numbers or two digit numbers", "label": "then she is studying numbers less than 100."}
{"text": "If the covariance between stock returns and bond yields is not positive", "label": "then there is no diversification benefit between holding stocks and bonds in a portfolio."}
{"text": "If the survey sample includes people from all age groups or the sample covers all geographic regions", "label": "then the survey sample is representative of the population."}
{"text": "If John did not catch any fish today", "label": "then he is disappointed with his fishing trip."}
{"text": "If the puppet show stage is not properly lit", "label": "then the puppet master will have difficulty seeing the puppets clearly to manipulate them."}
{"text": "If a strong hurricane is approaching the coastline or the coastal area is experiencing very high tides", "label": "then coastal flooding and erosion are likely to occur."}
{"text": "If a patient presents with both a high fever and a severe headache", "label": "then the patient may have meningitis, a serious infection of the protective membranes covering the brain and spinal cord."}
{"text": "If the patient is not making progress in therapy", "label": "then the therapist needs to adjust the treatment plan."}
{"text": "A skeptic questions the existence of God due to the lack of empirical evidence for divine existence. The skeptic also argues that the problem of evil, meaning the existence of suffering and injustice in the world, seems incompatible with the idea of an all-good and all-powerful God. If the skeptic questions God's existence on evidential grounds and finds the problem of evil to be a serious theological challenge", "label": "then the skeptic will maintain significant doubts about theistic belief."}
{"text": "A factory is releasing toxic chemicals into a nearby river. The water from this river is used by local farms for irrigating their crops. If a factory is releasing toxic chemicals into a river and that contaminated river water is used by farms for irrigation", "label": "then the crops grown by those farms will end up being contaminated with harmful substances from the pollution."}
{"text": "In a quantum well structure, electrons are confined within a small region. The quantum well has discrete energy levels due to the confinement. If electrons are confined in a quantum well structure and the quantum well has discrete energy levels", "label": "then quantum confinement effects should be observed."}
{"text": "If the president has support from the majority party in Congress or the president has high approval ratings with the public", "label": "then the president has political capital to advance his agenda."}
{"text": "If the aircraft's navigation system is not functioning properly", "label": "then the pilots are unable to accurately determine the plane's position."}
{"text": "If a painting evokes feelings of joy and happiness or uses bright, vibrant colors", "label": "then the painting is considered beautiful."}
{"text": "If Joseph decides to include either side leg lifts or side plank exercises in his Pilates routine", "label": "then his routine will target the muscles on the sides of his core."}
{"text": "Cheetahs being carnivorous mammals and the fastest land animals", "label": "implies that they are well adapted for hunting prey."}
{"text": "If the exercise instructor does not have their proper certification", "label": "then they are not allowed to teach any fitness classes at the gym."}
{"text": "If John received a bonus at work or got a pay raise", "label": "then his income increased this year."}
{"text": "If John has a set of acrylic paints and some blank canvases", "label": "then he is ready to start painting."}
{"text": "If a patient is experiencing chest pain or has shortness of breath", "label": "then the patient may be having a heart attack."}
{"text": "If the bus drivers are not on strike", "label": "then the public buses will be operating on schedule."}
{"text": "If John brushes his teeth twice a day and flosses daily", "label": "then he has good oral hygiene habits."}
{"text": "If the data analyst has both collected the sales data and cleaned the sales data", "label": "then the sales data is ready for analysis."}
{"text": "Suppose a religion's holy scripture contains some passages that appear to condone acts of violence. Additionally, the same scripture also has passages that seem to promote intolerance towards certain groups.", "label": "If the holy scripture contains both violence-condoning and intolerance-promoting passages, this would imply that the scripture includes morally problematic content that ought to be subjected to critical analysis and scrutiny."}
{"text": "If the Olympic flame is lit at the opening ceremony or the head of state declares the Olympic Games open", "label": "then the Olympic Games have officially begun."}
{"text": "In Greek mythology, the demigod Hercules was tasked by King Eurystheus to complete twelve challenging labors as penance. It was said that if Hercules did not complete his twelve labors", "label": "then he would not gain immortality and take his rightful place among the gods on Mount Olympus."}
{"text": "If John is new to playing the guitar and he practices for at least an hour every day", "label": "then he will quickly improve his guitar skills."}
{"text": "If the child does not have a fever", "label": "then the pediatrician recommends rest and fluids."}
{"text": "In the context of Tenrikyo, a Japanese religion that emphasizes joyful living, Yoshiko could demonstrate her wholehearted participation in the church service in one of two ways.", "label": "If Yoshiko performed the sacred Kagura dance with a joyful spirit or if she sang the Tenrikyo hymns with sincere devotion, this would imply that she participated fully and earnestly in the religious service."}
{"text": "If the Quran does not contain guidance for humanity", "label": "then it implies that people cannot live righteous lives according to the principles of Islam."}
{"text": "An investor is considering purchasing a high risk, high return stock. In addition, the investor already has a well-diversified investment portfolio. If both of these conditions are true", "label": "then it implies the investor will decide to purchase the high risk stock."}
{"text": "If a plant does not receive sufficient sunlight", "label": "then its leaves will turn yellow."}
{"text": "If the astronauts have completed their pre-flight training or the spacecraft has passed all safety checks", "label": "then the mission is ready for launch."}
{"text": "In Hindu mythology, Indra is the king of the devas (gods). If Indra does not go to battle against the asuras (demons)", "label": "then the devas do not achieve victory over the asuras."}
{"text": "If the patient does not have rheumatoid arthritis", "label": "then the patient's joint pain and stiffness are not explained by that diagnosis."}
{"text": "If the Great Plains region receives sufficient rainfall or irrigation systems are widely used", "label": "then crops grow well in the Great Plains."}
{"text": "If John receives his monthly paycheck and gets a year-end bonus from his employer", "label": "then he has enough money to cover his expenses this month."}
{"text": "If the mountain trail is not closed due to snow", "label": "then it is safe for hikers to use the trail."}
{"text": "If the simulation is using accurate input data or the computer model's algorithms are correctly implemented", "label": "then the computer model should produce realistic outputs."}
{"text": "If a patient has a malignant tumor or if the tumor has metastasized to other organs", "label": "then the cancer is at an advanced stage."}
{"text": "If Ms. Johnson has prepared a lesson on fractions and the students have the prerequisite knowledge of division", "label": "then the fraction lesson will be effective for the students."}
{"text": "If the patient has either pneumonia or bronchitis", "label": "then the patient has a respiratory infection."}
{"text": "If the neurotransmitter serotonin is not released in sufficient quantities in the brain", "label": "then it leads to the patient experiencing symptoms of depression."}
{"text": "If John is not feeling energetic", "label": "then he does not go for his usual morning run."}
{"text": "If John is eating a balanced diet with plenty of fruits and vegetables or he is exercising regularly for at least 30 minutes per day", "label": "then it implies John is leading a healthy lifestyle."}
{"text": "If the summoning ritual for the demon Baphomet was performed correctly or the appropriate sacrifices were offered", "label": "then Baphomet will be summoned."}
{"text": "If the underwater visibility is not good", "label": "then the dive is cancelled."}
{"text": "If a supernova has not recently occurred in a nearby galaxy", "label": "then the night sky will not appear brighter than usual to observers on Earth."}
{"text": "If the factory did not install new air pollution control equipment", "label": "then it will emit higher levels of harmful pollutants into the air."}
{"text": "If a new law has been proposed that would restrict free speech rights, and a large protest against the law is being organized", "label": "then activists are mobilizing to fight the proposed law."}
{"text": "If John is either training for a freestyle swimming competition or practicing his backstroke technique", "label": "then he must be in the pool working on his strokes."}
{"text": "If the water treatment plant is not operating at full capacity", "label": "then there will be water shortages in the city."}
{"text": "If a new highly transmissible virus is spreading in the community or vaccination rates are below the threshold for herd immunity", "label": "then there is a high risk of a major outbreak."}
{"text": "If the Earth's oceans are warming due to climate change or humans are emitting large amounts of greenhouse gases", "label": "then this implies that global temperatures are rising."}
{"text": "If a spiritual seeker has either studied the theosophical teachings of Madame Blavatsky or has meditated deeply to access the Akashic records", "label": "then they will have gained profound esoteric knowledge about the underlying mystical workings of the universe."}
{"text": "If the existence of the external world is not objectively verifiable through empirical evidence or logical proof", "label": "then the philosophical position of metaphysical solipsism, which holds that only one's own mind is sure to exist and that the external world and other minds cannot be known with certainty, cannot be conclusively refuted."}
{"text": "During the Holi festival, if the festival is being celebrated and people are gathering in the streets", "label": "then this leads to colorful powders being thrown."}
{"text": "In an operations research problem for a manufacturing plant, if the factory has sufficient raw materials to produce the goods and the factory equipment is operating at full capacity", "label": "then the production targets for the month will be met."}
{"text": "If a fiber optic cable is connected properly and the optical transmitter is functioning", "label": "then data can be successfully transmitted over the fiber optic network."}
{"text": "If the new Marvel movie is not a box office hit", "label": "then critics will give the movie negative reviews."}
{"text": "If the estuary does not have a high salt concentration", "label": "then it has a mix of fresh and salt water."}
{"text": "In many parts of the world, demand for agricultural land to grow crops and raise livestock is increasing. At the same time, markets for timber and wood products like paper and furniture are also growing. If both of these trends occur together - increasing demand for farmland and expanding timber markets -", "label": "then this will likely lead to accelerating rates of deforestation as more forests are cleared to make way for agriculture and wood harvesting."}
{"text": "If the CEO does not have strong leadership skills", "label": "then the company will underperform."}
{"text": "According to the folklore of the village, if they experience a long drought in the summer or if the village shaman has angered the rain spirits", "label": "then the rain dance ritual must be performed to bring the rains and end the drought."}
{"text": "If John believes he is an above average driver and he has not had any accidents or tickets in the past year", "label": "then his belief about his driving ability would be justified by evidence."}
{"text": "If the teacher did not give a pop quiz", "label": "then the students did not review the material from last class."}
{"text": "If the dominant cultural narrative promotes individualism or the media portrays success as a solo pursuit", "label": "then society encourages a \"pull yourself up by your bootstraps\" mentality."}
{"text": "If the pitcher threw either a fastball or a curveball", "label": "then the pitcher threw a pitch."}
{"text": "If the track is not muddy from rain", "label": "then the horses will run faster times."}
{"text": "If John's shirt is dirty or his pants are ripped", "label": "then he needs to change his outfit."}
{"text": "A city is planning to erect a monument to honor war veterans.", "label": "In order for the city to move forward with commissioning and constructing the monument, two things must happen: the city needs to plan to build the monument, and it needs to allocate funding for it in the annual budget."}
{"text": "If John does not have enough players for a full basketball game", "label": "then the pickup game at the park will be canceled."}
{"text": "If John either brushes his teeth in the morning or flosses his teeth in the morning", "label": "then John practices good oral hygiene in the morning."}
{"text": "If early hominids had larger brains relative to body size compared to other primates and engaged in more complex social behavior than other primates", "label": "then this implies that early hominids developed more advanced cognitive abilities."}
{"text": "If the incumbent president did not win the election", "label": "then there will be a transition of power to the opposition party."}
{"text": "If there is an oil spill in the ocean or toxic chemicals are dumped into a river", "label": "then marine life and ecosystems are harmed."}
{"text": "If a patient has blurred near vision and is over 40 years old", "label": "then the patient likely has presbyopia, an age-related condition that affects near vision."}
{"text": "If the town swimming pool is not closed for renovations this summer", "label": "then the community does not have access to a public swimming facility."}
{"text": "If the dishwasher is full of dirty dishes and there is no clean silverware", "label": "then it's time to run the dishwasher."}
{"text": "If John does not work at Google", "label": "then he works at a tech company."}
{"text": "If Gurpreet faithfully recites his morning prayers and attends the Gurdwara every Sunday", "label": "then he is considered a devout and practicing Sikh."}
{"text": "If the patient's teeth are not misaligned", "label": "then orthodontic treatment is not necessary."}
{"text": "If the patient does not have a bacterial infection", "label": "then antibiotics are not prescribed to the patient."}
{"text": "If John had both a motive and the opportunity to commit the robbery", "label": "then it implies he committed the robbery."}
{"text": "If a patient has both high blood pressure and coronary artery disease", "label": "then the patient is at high risk for a heart attack."}
{"text": "If John's imagination is not stimulated", "label": "then he does not feel inspired to create something new."}
{"text": "If John ate a nutritious breakfast or took his daily vitamins", "label": "then he is getting adequate nutrients."}
{"text": "If there has been adequate rainfall this year and the temperature has been favorable for tree growth", "label": "then the forest will be thriving and healthy."}
{"text": "If the fossilized skull fragment does not belong to the genus Homo", "label": "then it must be from an early hominid species that predates the Homo lineage."}